tut13/sol13.org
#+title: Lösungen zum 13. Übungsblatt
#+date: 2018-07-18
#+email: tobias.denkinger@tu-dresden.de
#+options: toc:nil

* Lösungen zu Aufgabe 1 (AGS 17.25b)

  * A: scanf("%i", x1);
       flag = 1;
       x1 = 3 + x1;
       x2 = 5;
  * B: x2 == x1
  * C: flag = 0;
       result = 30;
  * D: flag = 0;
       result = x2;
  * E: function == 2;
  * F: if (10 <= x2) {
         function = 2;
         x1 = x1 - x2;
         x2 = x2 - 1;
       } else {
         function = 1;
         x1 = x1 + x2;
         x2 = 10;
       }

* Wiederholungsaufgaben

| # | Aufgabe        | Zahl |
|---+----------------+------|
| 4 | λ-Kalkül       |   24 |
| 5 | Prolog⁻        |   17 |
| 3 | Unifikation    |   16 |
| 2 | Haskell        |    9 |
| 6 | C₁/AM₁         |    8 |
| 7 | H₀→AM₀ / H₀→C₀ |    5 |
|   |                |      |

Die Musterlösungen für alle mit * markierten Aufgaben stehen in der Aufgabensammlung.

** Lösungen zu Aufgabe 2 (AGS 12.1.50*)
** Lösungen zu Aufgabe 3 (AGS 12.2.14*)
** Lösungen zu Aufgabe 4 (AGS 12.4.33*)
*** Aufgabe a
#+begin_src elisp
(λfx.x(f(fx)))(λy.xy)
   ---------- -------
   GV={x}     FV={x}

⇒ₐ (λfx₁.x₁(f(fx₁)))(λy.xy)

⇒ᵦ (λx₁.x₁((λy.xy)((λy.xy)x₁)))
                      --- --
                    GV=∅  FV={x₁}

⇒ᵦ (λx₁.x₁((λy.xy)(xx₁)))
              --- ----
            GV=∅  FV={x, x₁}

⇒ᵦ (λx₁.x₁(x(xx₁)))
#+end_src

*** Aufgabe b

#+begin_src haskell
f :: Int -> Int -> Int
f x 0 = x * 2
f x y | y `mod` 2 == 0 = f x (y - 1)
      | otherwise      = f (x * 2) (y - 1)
#+end_src

