tut13/sol13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-18 Mi 18:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lösungen zum 13. Übungsblatt</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Lösungen zum 13. Übungsblatt</h1>

<div id="outline-container-org30adcc3" class="outline-2">
<h2 id="org30adcc3"><span class="section-number-2">1</span> Lösungen zu Aufgabe 1 (AGS 17.25b)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>A: scanf("%i", x1);
flag = 1;
x1 = 3 + x1;
x2 = 5;</li>
<li>B: x2 == x1</li>
<li>C: flag = 0;
result = 30;</li>
<li>D: flag = 0;
result = x2;</li>
<li>E: function == 2;</li>
<li>F: if (10 &lt;= x2) {
  function = 2;
  x1 = x1 - x2;
  x2 = x2 - 1;
} else {
  function = 1;
  x1 = x1 + x2;
  x2 = 10;
}</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc6640f" class="outline-2">
<h2 id="orgbc6640f"><span class="section-number-2">2</span> Wiederholungsaufgaben</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">#</th>
<th scope="col" class="org-left">Aufgabe</th>
<th scope="col" class="org-right">Zahl</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">λ-Kalkül</td>
<td class="org-right">24</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Prolog⁻</td>
<td class="org-right">17</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Unifikation</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Haskell</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">C₁/AM₁</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">H₀→AM₀ / H₀→C₀</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Die Musterlösungen für alle mit * markierten Aufgaben stehen in der Aufgabensammlung.
</p>
</div>

<div id="outline-container-org058c42b" class="outline-3">
<h3 id="org058c42b"><span class="section-number-3">2.1</span> Lösungen zu Aufgabe 2 (AGS 12.1.50*)</h3>
</div>
<div id="outline-container-org72a0f75" class="outline-3">
<h3 id="org72a0f75"><span class="section-number-3">2.2</span> Lösungen zu Aufgabe 3 (AGS 12.2.14*)</h3>
</div>
<div id="outline-container-org63d6694" class="outline-3">
<h3 id="org63d6694"><span class="section-number-3">2.3</span> Lösungen zu Aufgabe 4 (AGS 12.4.33*)</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org94d5b5e" class="outline-4">
<h4 id="org94d5b5e"><span class="section-number-4">2.3.1</span> Aufgabe a</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #2aa198;">(</span>&#955;fx.x<span style="color: #b58900;">(</span>f<span style="color: #268bd2;">(</span>fx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)(</span>&#955;y.xy<span style="color: #2aa198;">)</span>
   ---------- -------
   GV={x}     FV={x}

&#8658;&#8336; <span style="color: #2aa198;">(</span>&#955;fx&#8321;.x&#8321;<span style="color: #b58900;">(</span>f<span style="color: #268bd2;">(</span>fx&#8321;<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)(</span>&#955;y.xy<span style="color: #2aa198;">)</span>

&#8658;&#7526; <span style="color: #2aa198;">(</span>&#955;x&#8321;.x&#8321;<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>&#955;y.xy<span style="color: #268bd2;">)(</span><span style="color: #6c71c4;">(</span>&#955;y.xy<span style="color: #6c71c4;">)</span>x&#8321;<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
                      --- --
                    GV=&#8709;  FV={x&#8321;}

&#8658;&#7526; <span style="color: #2aa198;">(</span>&#955;x&#8321;.x&#8321;<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>&#955;y.xy<span style="color: #268bd2;">)(</span>xx&#8321;<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
              --- ----
            GV=&#8709;  FV={x, x&#8321;}

&#8658;&#7526; <span style="color: #2aa198;">(</span>&#955;x&#8321;.x&#8321;<span style="color: #b58900;">(</span>x<span style="color: #268bd2;">(</span>xx&#8321;<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9e15f8" class="outline-4">
<h4 id="orgc9e15f8"><span class="section-number-4">2.3.2</span> Aufgabe b</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">f</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Int</span>
<span style="color: #268bd2;">f</span> x <span style="color: #6c71c4;">0</span> <span style="color: #268bd2;">=</span> x <span style="color: #268bd2;">*</span> <span style="color: #6c71c4;">2</span>
<span style="color: #268bd2;">f</span> x y <span style="color: #268bd2;">|</span> y <span style="color: #268bd2;">`mod`</span> <span style="color: #6c71c4;">2</span> <span style="color: #268bd2;">==</span> <span style="color: #6c71c4;">0</span> <span style="color: #268bd2;">=</span> f x <span style="color: #2aa198;">(</span>y <span style="color: #268bd2;">-</span> <span style="color: #6c71c4;">1</span><span style="color: #2aa198;">)</span>
      <span style="color: #268bd2;">|</span> otherwise      <span style="color: #268bd2;">=</span> f <span style="color: #2aa198;">(</span>x <span style="color: #268bd2;">*</span> <span style="color: #6c71c4;">2</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span>y <span style="color: #268bd2;">-</span> <span style="color: #6c71c4;">1</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
