tut13/sol13.org
*** Aufgabe c

#+begin_src elisp
⟨Y⟩⟨F⟩
= (λh. (λy. h(yy)) (λy. h(yy))) ⟨F⟩
⇒* (λy. ⟨F⟩(yy)) (λy. ⟨F⟩(yy)) = ⟨t⟩ ⟨t⟩
⇒* ⟨F⟩ ((λy. ⟨F⟩(yy)) (λy. ⟨F⟩(yy))) = ⟨F⟩ (⟨t⟩⟨t⟩)

⟨Y⟩⟨F⟩⟨2⟩⟨1⟩
⇒* ⟨F⟩ (⟨t⟩⟨t⟩) ⟨2⟩ ⟨1⟩
⇒* ⟨ite⟩ (⟨iszero⟩⟨1⟩) (…) (⟨ite⟩ (⟨iszero⟩(⟨mod⟩⟨1⟩⟨2⟩)) (…) ((⟨t⟩⟨t⟩) (⟨mult⟩⟨2⟩⟨2⟩) (⟨pred⟩⟨1⟩)))
         -------------            -----------------------               -------------- -----------
         ⇒* ⟨false⟩               ⇒* ⟨false⟩                            ⇒* ⟨4⟩         ⇒* ⟨0⟩
⇒* ⟨t⟩⟨t⟩ ⟨4⟩ ⟨0⟩
⇒* ⟨F⟩ (⟨t⟩⟨t⟩) ⟨4⟩ ⟨0⟩
⇒* ⟨ite⟩ (⟨iszero⟩⟨0⟩) (⟨mult⟩⟨4⟩⟨2⟩) (…)
         ------------- --------------
         ⇒* ⟨true⟩     ⇒* ⟨8⟩
⇒* ⟨8⟩
#+end_src

** Lösungen zu Aufgabe 5
