tut13/sol13.html

<div id="outline-container-org4b6be33" class="outline-4">
<h4 id="org4b6be33"><span class="section-number-4">2.3.3</span> Aufgabe c</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #2aa198;">&#10216;</span>Y<span style="color: #2aa198;">&#10217;&#10216;</span>F<span style="color: #2aa198;">&#10217;</span>
= <span style="color: #2aa198;">(</span>&#955;h. <span style="color: #b58900;">(</span>&#955;y. h<span style="color: #268bd2;">(</span>yy<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>&#955;y. h<span style="color: #268bd2;">(</span>yy<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">&#10216;</span>F<span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">(</span>&#955;y. <span style="color: #b58900;">&#10216;</span>F<span style="color: #b58900;">&#10217;(</span>yy<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span>&#955;y. <span style="color: #b58900;">&#10216;</span>F<span style="color: #b58900;">&#10217;(</span>yy<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> = <span style="color: #2aa198;">&#10216;</span>t<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">&#10216;</span>t<span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">&#10216;</span>F<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>&#955;y. <span style="color: #268bd2;">&#10216;</span>F<span style="color: #268bd2;">&#10217;(</span>yy<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>&#955;y. <span style="color: #268bd2;">&#10216;</span>F<span style="color: #268bd2;">&#10217;(</span>yy<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> = <span style="color: #2aa198;">&#10216;</span>F<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">&#10216;</span>t<span style="color: #b58900;">&#10217;&#10216;</span>t<span style="color: #b58900;">&#10217;</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">&#10216;</span>Y<span style="color: #2aa198;">&#10217;&#10216;</span>F<span style="color: #2aa198;">&#10217;&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #2aa198;">&#10217;&#10216;</span><span style="color: #6c71c4;">1</span><span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">&#10216;</span>F<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">&#10216;</span>t<span style="color: #b58900;">&#10217;&#10216;</span>t<span style="color: #b58900;">&#10217;</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">1</span><span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">&#10216;</span>ite<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">&#10216;</span>iszero<span style="color: #b58900;">&#10217;&#10216;</span><span style="color: #6c71c4;">1</span><span style="color: #b58900;">&#10217;</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span>&#8230;<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">&#10216;</span>ite<span style="color: #b58900;">&#10217;</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">&#10216;</span>iszero<span style="color: #268bd2;">&#10217;(</span><span style="color: #6c71c4;">&#10216;</span>mod<span style="color: #6c71c4;">&#10217;&#10216;</span><span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">&#10217;&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">&#10217;</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>&#8230;<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span><span style="color: #6c71c4;">&#10216;</span>t<span style="color: #6c71c4;">&#10217;&#10216;</span>t<span style="color: #6c71c4;">&#10217;</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">&#10216;</span>mult<span style="color: #6c71c4;">&#10217;&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">&#10217;&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">&#10217;</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">&#10216;</span>pred<span style="color: #6c71c4;">&#10217;&#10216;</span><span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">&#10217;</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
         -------------            -----------------------               -------------- -----------
         &#8658;* <span style="color: #2aa198;">&#10216;</span>false<span style="color: #2aa198;">&#10217;</span>               &#8658;* <span style="color: #2aa198;">&#10216;</span>false<span style="color: #2aa198;">&#10217;</span>                            &#8658;* <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">4</span><span style="color: #2aa198;">&#10217;</span>         &#8658;* <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">&#10216;</span>t<span style="color: #2aa198;">&#10217;&#10216;</span>t<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">4</span><span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">&#10216;</span>F<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">&#10216;</span>t<span style="color: #b58900;">&#10217;&#10216;</span>t<span style="color: #b58900;">&#10217;</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">4</span><span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">&#10216;</span>ite<span style="color: #2aa198;">&#10217;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">&#10216;</span>iszero<span style="color: #b58900;">&#10217;&#10216;</span><span style="color: #6c71c4;">0</span><span style="color: #b58900;">&#10217;</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">&#10216;</span>mult<span style="color: #b58900;">&#10217;&#10216;</span><span style="color: #6c71c4;">4</span><span style="color: #b58900;">&#10217;&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #b58900;">&#10217;</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span>&#8230;<span style="color: #2aa198;">)</span>
         ------------- --------------
         &#8658;* <span style="color: #2aa198;">&#10216;</span>true<span style="color: #2aa198;">&#10217;</span>     &#8658;* <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">8</span><span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">8</span><span style="color: #2aa198;">&#10217;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6ea61f8" class="outline-3">
<h3 id="org6ea61f8"><span class="section-number-3">2.4</span> Lösungen zu Aufgabe 5</h3>
<div class="outline-text-3" id="text-2-4">
</div>
