tut13/sol13.org
*** Thomas' Lösung

#+begin_src prolog
                  ?-  c(<2>, <2>, <4>).
                  ?-* c(<2>, 0, Z2), b(Z2, <2>, Z1), b(Z1, <2>, <4>).                        % 13
{Z2 = <1>}        ?-  nat(<2>), b(<1>, <2>, Z1), b(Z1, <2>, <4>).                            % 12
                  ?-* nat(0), b(<1>, <2>, Z1), b(Z1, <2>, <4>).                              % 2
                  ?-  b(<1>, <2>, Z1), b(Z1, <2>, <4>).                                      % 1
                  ?-* b(<1>, 0, M2), a(M2, <1>, M1), a(M1, <1>, Z1), b(Z1, <2>, <4>).        % 10
{M2 = 0}          ?-  nat(<1>), a(0, <1>, M1), a(M1, <1>, Z1), b(Z1, <2>, <4>).              % 9
                  ?-  nat(0), a(0, <1>, M1), a(M1, <1>, Z1), b(Z1, <2>, <4>).                % 2
                  ?-  a(0, <1>, M1), a(M1, <1>, Z1), b(Z1, <2>, <4>).                        % 1
{M1 = <1>}        ?-  nat(<1>), a(<1>, <1>, Z1), b(Z1, <2>, <4>).                            % 6
                  ?-  nat(0), a(<1>, <1>, Z1), b(Z1, <2>, <4>).                              % 2
                  ?-  a(<1>, <1>, Z1), b(Z1, <2>, <4>).                                      % 1
{Z1 = s(s(Z11))}  ?-  a(0, 0, Z11), b(s(s(Z11)), <2>, <4>).                                  % 7
{Z11 = 0}         ?-  b(<2>, <2>, <4>).                                                      % 4
                  ?-* b(<2>, 0, M4), a(M4, <2>, M3), a(M3, <2>, <4>).                        % 10 
{M4 = 0}          ?-  nat(<2>), a(0, <2>, M3), a(M3, <2>, <4>).                              % 9
                  ?-* nat(0), a(0, <2>, M3), a(M3, <2>, <4>).                                % 2 
                  ?-  a(0, <2>, M3), a(M3, <2>, <4>).                                        % 1
{M3 = <2>}        ?-  nat(<2>), a(<2>, <2>, <4>).                                            % 6
                  ?-* nat(0), a(<2>, <2>, <4>).                                              % 2 
                  ?-  a(<2>, <2>, <4>).                                                      % 1
                  ?-* a(0, 0, 0).                                                            % 7
                  ?-.                                                                        % 4
#+end_src

  * a—Addition, b—Multiplikation, c—Potenz

