tut13/sol13.html
<div id="outline-container-org12d5cad" class="outline-4">
<h4 id="org12d5cad"><span class="section-number-4">2.4.1</span> Thomas' Lösung</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-prolog">                  ?-  c<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.
                  ?-* c<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">Z2</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z2</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                        <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">13</span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">Z2</span> = &lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198; font-weight: bold;">}</span>        ?-  nat<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;<span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                            <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">12</span>
                  ?-* nat<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                              <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">2</span>
                  ?-  b<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                      <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
                  ?-* b<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">M2</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M2</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">M1</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M1</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.        <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">10</span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">M2</span> = <span style="color: #6c71c4;">0</span><span style="color: #2aa198; font-weight: bold;">}</span>          ?-  nat<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">M1</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M1</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.              <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">9</span>
                  ?-  nat<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">M1</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M1</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">2</span>
                  ?-  a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">M1</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M1</span>, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                        <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">M1</span> = &lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198; font-weight: bold;">}</span>        ?-  nat<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;<span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                            <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">6</span>
                  ?-  nat<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                              <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">2</span>
                  ?-  a<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">1</span>&gt;, &lt;<span style="color: #6c71c4;">1</span>&gt;, <span style="color: #268bd2;">Z1</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span><span style="color: #268bd2;">Z1</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                      <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">Z1</span> = s<span style="color: #b58900;">(</span>s<span style="color: #268bd2;">(</span><span style="color: #268bd2;">Z11</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198; font-weight: bold;">}</span>  ?-  a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">Z11</span><span style="color: #2aa198;">)</span>, b<span style="color: #2aa198;">(</span>s<span style="color: #b58900;">(</span>s<span style="color: #268bd2;">(</span><span style="color: #268bd2;">Z11</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                  <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">7</span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">Z11</span> = <span style="color: #6c71c4;">0</span><span style="color: #2aa198; font-weight: bold;">}</span>         ?-  b<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                                      <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">4</span>
                  ?-* b<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #6c71c4;">0</span>, <span style="color: #268bd2;">M4</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M4</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">M3</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M3</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                        <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">10 </span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">M4</span> = <span style="color: #6c71c4;">0</span><span style="color: #2aa198; font-weight: bold;">}</span>          ?-  nat<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;<span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">M3</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M3</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                              <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">9</span>
                  ?-* nat<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">M3</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M3</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">2 </span>
                  ?-  a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, <span style="color: #268bd2;">M3</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span><span style="color: #268bd2;">M3</span>, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                        <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
<span style="color: #2aa198; font-weight: bold;">{</span><span style="color: #268bd2;">M3</span> = &lt;<span style="color: #6c71c4;">2</span>&gt;<span style="color: #2aa198; font-weight: bold;">}</span>        ?-  nat<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;<span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                            <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">6</span>
                  ?-* nat<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>, a<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                              <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">2 </span>
                  ?-  a<span style="color: #2aa198;">(</span>&lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">2</span>&gt;, &lt;<span style="color: #6c71c4;">4</span>&gt;<span style="color: #2aa198;">)</span>.                                                      <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">1</span>
                  ?-* a<span style="color: #2aa198;">(</span><span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">)</span>.                                                            <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">7</span>
                  ?-.                                                                        <span style="color: #93a1a1;">% </span><span style="color: #93a1a1;">4</span>
</pre>
</div>

<ul class="org-ul">
<li>a—Addition, b—Multiplikation, c—Potenz</li>
</ul>
</div>
</div>
</div>
